is1200-example-projects/mcb32tools/headers/proc/p32mz2048ech064.h
#define _IPC37_w_POSITION                        0x00000000
#define _IPC37_w_MASK                            0xFFFFFFFF
#define _IPC37_w_LENGTH                          0x00000020

#define _IPC38_CAN2IS_POSITION                   0x00000000
#define _IPC38_CAN2IS_MASK                       0x00000003
#define _IPC38_CAN2IS_LENGTH                     0x00000002

#define _IPC38_CAN2IP_POSITION                   0x00000002
#define _IPC38_CAN2IP_MASK                       0x0000001C
#define _IPC38_CAN2IP_LENGTH                     0x00000003

#define _IPC38_ETHIS_POSITION                    0x00000008
#define _IPC38_ETHIS_MASK                        0x00000300
#define _IPC38_ETHIS_LENGTH                      0x00000002

#define _IPC38_ETHIP_POSITION                    0x0000000A
#define _IPC38_ETHIP_MASK                        0x00001C00
#define _IPC38_ETHIP_LENGTH                      0x00000003

#define _IPC38_SPI3EIS_POSITION                  0x00000010
#define _IPC38_SPI3EIS_MASK                      0x00030000
#define _IPC38_SPI3EIS_LENGTH                    0x00000002

#define _IPC38_SPI3EIP_POSITION                  0x00000012
#define _IPC38_SPI3EIP_MASK                      0x001C0000
#define _IPC38_SPI3EIP_LENGTH                    0x00000003

#define _IPC38_SPI3RXIS_POSITION                 0x00000018
#define _IPC38_SPI3RXIS_MASK                     0x03000000
#define _IPC38_SPI3RXIS_LENGTH                   0x00000002

#define _IPC38_SPI3RXIP_POSITION                 0x0000001A
#define _IPC38_SPI3RXIP_MASK                     0x1C000000
#define _IPC38_SPI3RXIP_LENGTH                   0x00000003

#define _IPC38_w_POSITION                        0x00000000
#define _IPC38_w_MASK                            0xFFFFFFFF
#define _IPC38_w_LENGTH                          0x00000020

#define _IPC39_SPI3TXIS_POSITION                 0x00000000
#define _IPC39_SPI3TXIS_MASK                     0x00000003
#define _IPC39_SPI3TXIS_LENGTH                   0x00000002

#define _IPC39_SPI3TXIP_POSITION                 0x00000002
#define _IPC39_SPI3TXIP_MASK                     0x0000001C
#define _IPC39_SPI3TXIP_LENGTH                   0x00000003

#define _IPC39_U3EIS_POSITION                    0x00000008
#define _IPC39_U3EIS_MASK                        0x00000300
#define _IPC39_U3EIS_LENGTH                      0x00000002

#define _IPC39_U3EIP_POSITION                    0x0000000A
#define _IPC39_U3EIP_MASK                        0x00001C00
#define _IPC39_U3EIP_LENGTH                      0x00000003

#define _IPC39_U3RXIS_POSITION                   0x00000010
#define _IPC39_U3RXIS_MASK                       0x00030000
#define _IPC39_U3RXIS_LENGTH                     0x00000002

#define _IPC39_U3RXIP_POSITION                   0x00000012
#define _IPC39_U3RXIP_MASK                       0x001C0000
#define _IPC39_U3RXIP_LENGTH                     0x00000003

#define _IPC39_U3TXIS_POSITION                   0x00000018
#define _IPC39_U3TXIS_MASK                       0x03000000
#define _IPC39_U3TXIS_LENGTH                     0x00000002

#define _IPC39_U3TXIP_POSITION                   0x0000001A
#define _IPC39_U3TXIP_MASK                       0x1C000000
#define _IPC39_U3TXIP_LENGTH                     0x00000003

#define _IPC39_w_POSITION                        0x00000000
#define _IPC39_w_MASK                            0xFFFFFFFF
#define _IPC39_w_LENGTH                          0x00000020

#define _IPC40_I2C3BIS_POSITION                  0x00000000
#define _IPC40_I2C3BIS_MASK                      0x00000003
#define _IPC40_I2C3BIS_LENGTH                    0x00000002

#define _IPC40_I2C3BIP_POSITION                  0x00000002
#define _IPC40_I2C3BIP_MASK                      0x0000001C
#define _IPC40_I2C3BIP_LENGTH                    0x00000003

#define _IPC40_I2C3SIS_POSITION                  0x00000008
#define _IPC40_I2C3SIS_MASK                      0x00000300
#define _IPC40_I2C3SIS_LENGTH                    0x00000002

#define _IPC40_I2C3SIP_POSITION                  0x0000000A
#define _IPC40_I2C3SIP_MASK                      0x00001C00
#define _IPC40_I2C3SIP_LENGTH                    0x00000003

#define _IPC40_I2C3MIS_POSITION                  0x00000010
#define _IPC40_I2C3MIS_MASK                      0x00030000
#define _IPC40_I2C3MIS_LENGTH                    0x00000002

#define _IPC40_I2C3MIP_POSITION                  0x00000012
#define _IPC40_I2C3MIP_MASK                      0x001C0000
#define _IPC40_I2C3MIP_LENGTH                    0x00000003

#define _IPC40_SPI4EIS_POSITION                  0x00000018
#define _IPC40_SPI4EIS_MASK                      0x03000000
#define _IPC40_SPI4EIS_LENGTH                    0x00000002

#define _IPC40_SPI4EIP_POSITION                  0x0000001A
#define _IPC40_SPI4EIP_MASK                      0x1C000000
#define _IPC40_SPI4EIP_LENGTH                    0x00000003

#define _IPC40_w_POSITION                        0x00000000
#define _IPC40_w_MASK                            0xFFFFFFFF
#define _IPC40_w_LENGTH                          0x00000020

#define _IPC41_SPI4RXIS_POSITION                 0x00000000
#define _IPC41_SPI4RXIS_MASK                     0x00000003
#define _IPC41_SPI4RXIS_LENGTH                   0x00000002

#define _IPC41_SPI4RXIP_POSITION                 0x00000002
#define _IPC41_SPI4RXIP_MASK                     0x0000001C
#define _IPC41_SPI4RXIP_LENGTH                   0x00000003

#define _IPC41_SPI4TXIS_POSITION                 0x00000008
#define _IPC41_SPI4TXIS_MASK                     0x00000300
#define _IPC41_SPI4TXIS_LENGTH                   0x00000002

#define _IPC41_SPI4TXIP_POSITION                 0x0000000A
#define _IPC41_SPI4TXIP_MASK                     0x00001C00
#define _IPC41_SPI4TXIP_LENGTH                   0x00000003

#define _IPC41_RTCCIS_POSITION                   0x00000010
#define _IPC41_RTCCIS_MASK                       0x00030000
#define _IPC41_RTCCIS_LENGTH                     0x00000002

#define _IPC41_RTCCIP_POSITION                   0x00000012
#define _IPC41_RTCCIP_MASK                       0x001C0000
#define _IPC41_RTCCIP_LENGTH                     0x00000003

