is1200-example-projects/mcb32tools/headers/proc/p32mz2048ech064.h
#define _EMAC1MIND_w_POSITION                    0x00000000
#define _EMAC1MIND_w_MASK                        0xFFFFFFFF
#define _EMAC1MIND_w_LENGTH                      0x00000020

#define _EMACxMIND_MIIMBUSY_POSITION             0x00000000
#define _EMACxMIND_MIIMBUSY_MASK                 0x00000001
#define _EMACxMIND_MIIMBUSY_LENGTH               0x00000001

#define _EMACxMIND_SCAN_POSITION                 0x00000001
#define _EMACxMIND_SCAN_MASK                     0x00000002
#define _EMACxMIND_SCAN_LENGTH                   0x00000001

#define _EMACxMIND_NOTVALID_POSITION             0x00000002
#define _EMACxMIND_NOTVALID_MASK                 0x00000004
#define _EMACxMIND_NOTVALID_LENGTH               0x00000001

#define _EMACxMIND_LINKFAIL_POSITION             0x00000003
#define _EMACxMIND_LINKFAIL_MASK                 0x00000008
#define _EMACxMIND_LINKFAIL_LENGTH               0x00000001

#define _EMACxMIND_w_POSITION                    0x00000000
#define _EMACxMIND_w_MASK                        0xFFFFFFFF
#define _EMACxMIND_w_LENGTH                      0x00000020

#define _EMAC1SA0_STNADDR5_POSITION              0x00000000
#define _EMAC1SA0_STNADDR5_MASK                  0x000000FF
#define _EMAC1SA0_STNADDR5_LENGTH                0x00000008

#define _EMAC1SA0_STNADDR6_POSITION              0x00000008
#define _EMAC1SA0_STNADDR6_MASK                  0x0000FF00
#define _EMAC1SA0_STNADDR6_LENGTH                0x00000008

#define _EMAC1SA0_w_POSITION                     0x00000000
#define _EMAC1SA0_w_MASK                         0xFFFFFFFF
#define _EMAC1SA0_w_LENGTH                       0x00000020

#define _EMACxSA0_STNADDR5_POSITION              0x00000000
#define _EMACxSA0_STNADDR5_MASK                  0x000000FF
#define _EMACxSA0_STNADDR5_LENGTH                0x00000008

#define _EMACxSA0_STNADDR6_POSITION              0x00000008
#define _EMACxSA0_STNADDR6_MASK                  0x0000FF00
#define _EMACxSA0_STNADDR6_LENGTH                0x00000008

#define _EMACxSA0_w_POSITION                     0x00000000
#define _EMACxSA0_w_MASK                         0xFFFFFFFF
#define _EMACxSA0_w_LENGTH                       0x00000020

#define _EMAC1SA1_STNADDR3_POSITION              0x00000000
#define _EMAC1SA1_STNADDR3_MASK                  0x000000FF
#define _EMAC1SA1_STNADDR3_LENGTH                0x00000008

#define _EMAC1SA1_STNADDR4_POSITION              0x00000008
#define _EMAC1SA1_STNADDR4_MASK                  0x0000FF00
#define _EMAC1SA1_STNADDR4_LENGTH                0x00000008

#define _EMAC1SA1_w_POSITION                     0x00000000
#define _EMAC1SA1_w_MASK                         0xFFFFFFFF
#define _EMAC1SA1_w_LENGTH                       0x00000020

#define _EMACxSA1_STNADDR3_POSITION              0x00000000
#define _EMACxSA1_STNADDR3_MASK                  0x000000FF
#define _EMACxSA1_STNADDR3_LENGTH                0x00000008

#define _EMACxSA1_STNADDR4_POSITION              0x00000008
#define _EMACxSA1_STNADDR4_MASK                  0x0000FF00
#define _EMACxSA1_STNADDR4_LENGTH                0x00000008

#define _EMACxSA1_w_POSITION                     0x00000000
#define _EMACxSA1_w_MASK                         0xFFFFFFFF
#define _EMACxSA1_w_LENGTH                       0x00000020

#define _EMAC1SA2_STNADDR1_POSITION              0x00000000
#define _EMAC1SA2_STNADDR1_MASK                  0x000000FF
#define _EMAC1SA2_STNADDR1_LENGTH                0x00000008

#define _EMAC1SA2_STNADDR2_POSITION              0x00000008
#define _EMAC1SA2_STNADDR2_MASK                  0x0000FF00
#define _EMAC1SA2_STNADDR2_LENGTH                0x00000008

#define _EMAC1SA2_w_POSITION                     0x00000000
#define _EMAC1SA2_w_MASK                         0xFFFFFFFF
#define _EMAC1SA2_w_LENGTH                       0x00000020

#define _EMACxSA2_STNADDR1_POSITION              0x00000000
#define _EMACxSA2_STNADDR1_MASK                  0x000000FF
#define _EMACxSA2_STNADDR1_LENGTH                0x00000008

#define _EMACxSA2_STNADDR2_POSITION              0x00000008
#define _EMACxSA2_STNADDR2_MASK                  0x0000FF00
#define _EMACxSA2_STNADDR2_LENGTH                0x00000008

#define _EMACxSA2_w_POSITION                     0x00000000
#define _EMACxSA2_w_MASK                         0xFFFFFFFF
#define _EMACxSA2_w_LENGTH                       0x00000020

#define _PRECON_PFMWS_POSITION                   0x00000000
#define _PRECON_PFMWS_MASK                       0x00000007
#define _PRECON_PFMWS_LENGTH                     0x00000003

#define _PRECON_PREFEN_POSITION                  0x00000004
#define _PRECON_PREFEN_MASK                      0x00000030
#define _PRECON_PREFEN_LENGTH                    0x00000002

#define _PRECON_PFMSECEN_POSITION                0x0000001A
#define _PRECON_PFMSECEN_MASK                    0x04000000
#define _PRECON_PFMSECEN_LENGTH                  0x00000001

#define _PRESTAT_PFMSECCNT_POSITION              0x00000000
#define _PRESTAT_PFMSECCNT_MASK                  0x000000FF
#define _PRESTAT_PFMSECCNT_LENGTH                0x00000008

#define _PRESTAT_PFMSEC_POSITION                 0x0000001A
#define _PRESTAT_PFMSEC_MASK                     0x04000000
#define _PRESTAT_PFMSEC_LENGTH                   0x00000001

#define _PRESTAT_PFMDED_POSITION                 0x0000001B
#define _PRESTAT_PFMDED_MASK                     0x08000000
#define _PRESTAT_PFMDED_LENGTH                   0x00000001

#define _SQI1XCON1_TYPECMD_POSITION              0x00000000
#define _SQI1XCON1_TYPECMD_MASK                  0x00000003
#define _SQI1XCON1_TYPECMD_LENGTH                0x00000002

#define _SQI1XCON1_TYPEADDR_POSITION             0x00000002
#define _SQI1XCON1_TYPEADDR_MASK                 0x0000000C
#define _SQI1XCON1_TYPEADDR_LENGTH               0x00000002

#define _SQI1XCON1_TYPEMODE_POSITION             0x00000004
#define _SQI1XCON1_TYPEMODE_MASK                 0x00000030
#define _SQI1XCON1_TYPEMODE_LENGTH               0x00000002

#define _SQI1XCON1_TYPEDUMMY_POSITION            0x00000006
#define _SQI1XCON1_TYPEDUMMY_MASK                0x000000C0
#define _SQI1XCON1_TYPEDUMMY_LENGTH              0x00000002

#define _SQI1XCON1_TYPEDATA_POSITION             0x00000008
#define _SQI1XCON1_TYPEDATA_MASK                 0x00000300
#define _SQI1XCON1_TYPEDATA_LENGTH               0x00000002

#define _SQI1XCON1_READOPCODE_POSITION           0x0000000A
#define _SQI1XCON1_READOPCODE_MASK               0x0003FC00
#define _SQI1XCON1_READOPCODE_LENGTH             0x00000008

#define _SQI1XCON1_ADDRBYTES_POSITION            0x00000012
#define _SQI1XCON1_ADDRBYTES_MASK                0x001C0000
#define _SQI1XCON1_ADDRBYTES_LENGTH              0x00000003

#define _SQI1XCON1_DUMMYBYTES_POSITION           0x00000015
#define _SQI1XCON1_DUMMYBYTES_MASK               0x00E00000
#define _SQI1XCON1_DUMMYBYTES_LENGTH             0x00000003

#define _SQI1XCON2_MODECODE_POSITION             0x00000000
#define _SQI1XCON2_MODECODE_MASK                 0x000000FF
#define _SQI1XCON2_MODECODE_LENGTH               0x00000008

#define _SQI1XCON2_MODEBYTES_POSITION            0x00000008
#define _SQI1XCON2_MODEBYTES_MASK                0x00000300
#define _SQI1XCON2_MODEBYTES_LENGTH              0x00000002

#define _SQI1XCON2_DEVSEL_POSITION               0x0000000A
#define _SQI1XCON2_DEVSEL_MASK                   0x00000C00
#define _SQI1XCON2_DEVSEL_LENGTH                 0x00000002

